src/Catalogs/ИС_WB_НастройкиПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_WB_НастройкиПечати</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПринтера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОриентацияСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снизу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонтитулыСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонтитулыСнизу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземпляровНаСтраницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКопий</Name>
					<Comment>ИнфоСофт Прокопцов Д. И. 03.03.2025 УА #93657</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_WB_НастройкиПечати/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 28.05.24 УА #70165
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда 
		ЗаполнитьЗначенияПоУмолчанию();
	КонецЕсли;	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.05.24 УА #70165

//+ ИнфоСофт Ивонин К.А. 28.05.24 УА #70165
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если Объект.Масштаб = 0 Тогда
		Объект.МасштабЗначение = 100;
		Элементы.МасштабЗначение.Доступность = Ложь;
	Иначе
		Элементы.МасштабЗначение.Доступность = Истина;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	
	СписокПринтеров = Новый Массив;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Список принтеров не доступен");
		Возврат;
	КонецЕсли;
	
	Попытка
		COMОбъект = ПолучитьCOMОбъект("winmgmts:\\.\root\CIMV2");
	Исключение
	
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = "Список принтеров не доступен по причине:" + ТекстОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	
	КонецПопытки;
	
	ВыборкаПринтеров = COMОбъект.ExecQuery("SELECT * FROM Win32_Printer", , 48);
	
	Для Каждого Принтер Из ВыборкаПринтеров Цикл
		Элементы.ИмяПринтера.СписокВыбора.Добавить(Принтер.Caption);
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.05.24 УА #70165

//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	
	Если Объект.Масштаб = 0 Тогда
		Объект.МасштабЗначение = 100;
		Элементы.МасштабЗначение.Доступность = Ложь;
	Иначе
		Элементы.МасштабЗначение.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 03.12.24 УА #72698

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 28.05.24 УА #70165
&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию() 
	
	Если Не ЗначениеЗаполнено(Объект.Слева) Тогда
		Объект.Слева = 10;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Справа) Тогда
		Объект.Справа = 10;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Сверху) Тогда
		Объект.Сверху = 10;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Снизу) Тогда
		Объект.Снизу = 10;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КолонтитулыСверху) Тогда
		Объект.КолонтитулыСверху = 10;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КолонтитулыСнизу) Тогда
		Объект.КолонтитулыСнизу = 10;	
	КонецЕсли; 
	
	Если Объект.ЭкземпляровНаСтраницу = 0 Тогда
		Объект.ЭкземпляровНаСтраницу = 1;	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если Объект.Масштаб = 0 Тогда
		Элементы.МасштабЗначение.Доступность = Ложь;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.05.24 УА #70165

#КонецОбласти
